Repository: nervo/wiican
Catalog: po/*.po
Languages: ca, da, de, es, fr, gl, it, nl, pt_br, ru, sv

source: translator-credits
es: J. Félix Ontañón Launchpad Contributions: J. Félix Ontañón https://launchpad.net/~fontanon Sergio Cuellar Valdes https://launchpad.net/~herrsergio

source: Visible
da: Synlig
de: Sichtbar
