Repository: nervo/wiican
Catalog: po/*.po
Languages: ca, da, de, es, fr, gl, it, nl, pt_br, ru, sv

source: Plug a bluetooth adapter
ca: Connecteu un adaptador Bluetooth
da: Indsæt en bluetooth adapter
de: Schließe einen Bluetoothadapter an
es: Enchufa un adaptador bluetooth
fr: Branchez un adaptateur bluetooth
gl: Conecte un adaptador Bluetooth
it: Inserisci un adattatore bluetooth
nl: Sluit een bluetooth-adapter aan
pt_br: Ative um adaptador bluetooth
ru: Подключите bluetooth адаптер
sv: Anslut en bluetooth adapter

source: Please load uinput module first
ca: Carregueu primer el mòdul uinput
fr: Commencez par charger le module uinput
gl: Porfavor cargue primeiro o modulo de conexión
it: Per favore carica il modulo uinput prima
nl: Laad alstublieft eerst uinput module
pt_br: Por favor, carregue primeiro o módulo uinput
ru: Пожалуйста, сначала загрузить модуль uinput
sv: Var god läs in inmatningsmodulen först

source: Hold left button for use wiimote Right button for menu
ca: Mantingueu premut el botó esquerra per a utilitzar el Wiimote o el bot dret per accedir al menú.
da: Tryk venstre knappen for at bruge Wii controlleren Højre knappen for menu
es: Manten presionado el botón izquierdo para usar el wiimote Botón derecho para el menú
fr: Maintenez le bouton gauche enfoncé pour utiliser la wiimote Maintenez le bouton droit enfoncé pour le menu
gl: Prema o botón esquerdo para usar o mando Wii. Prema o botón dereito para o menú.
it: Premi il tasto sinistro per usare il wiimote Tasto destro per il menu
nl: Houd de linker muisknop ingedrukt om de wiimote te gebruiken Rechter muisknop voor menu
pt_br: Pressione e segure o botão esquerdo para usar o Wii Remote Botão direito para acessar opções
ru: Удерживайте левую кнопку для использования wiimote Правую кнопку для вызова меню
sv: Håll ned vänster knapp för att använda Wiimote Höger knapp för meny

source: Discovering Wiimote
ca: S'està cercant el Wiimote
da: Søger efter Wii controlleren
de: Wiimote entdeckt
es: Descubriendo Wiimote
fr: Recherche de Wiimotes
gl: Buscando o mando Wii
it: Sto cercando il Wiimote
nl: Wiimote detecteren
pt_br: Procurando o Wii Remote
ru: Поиск wiimote
sv: Söker efter Wii handkontroll

source: Add visible mappings
ca: Afegeix el mapeig visible
fr: Ajouter des mappings visibles
gl: Engadir os mapeados visibles
it: Aggiungi mappature visibili
nl: Zichtbare mappings toevoegen
pt_br: Adicionar mapeamentos visíveis
ru: Добавить видимые привязки
sv: Lägg till synliga kartläggning

source: Editing
ca: S'està editant
da: Redigerer
de: Bearbeite
es: Editando
fr: Édition
gl: Editando
it: Modifica
nl: Bewerken van
pt_br: Editando
ru: Редактирование
sv: Redigerar

source: Press 1+2
ca: Premeu 1+2
fr: Appuyer sur les boutons 1 et 2
gl: Pulsar 1+2
it: Premi 1+2
nl: Druk op 1+2
pt_br: Pressione 1+2
ru: Нажмите одновременно кнопки 1+2
sv: Tryck 1+2

source: To put you Wiimote in discoverable mode now
ca: Posar el vostre Wiimote en mode descobriment ara
fr: Pour passer la wiimote en mode de recherche
gl: Activa o modo rastreo no teu wiimote
it: Per mettervi Wiimote in modalità rilevazione ora
nl: Om uw Wiimote in de waarneembare modus te zetten
pt_br: Colocar seu Wii Remote no modo de busca agora
ru: Чтобы перевести ваш Wiimote в режим обнаружения сейчас
sv: För att sätta din Wiimote i synligt läge nu

source: Not %s file found on wiican package
ca: No s'ha trobat el fitxer %s al paquet del wiican
fr: Le fichier %s n'a pas été trouvé dans le paquet wiican
gl: Non se topou o arquivo %s nos paquetes wiican
it: Nessun %s file trovato nel pacchetto wiican
nl: Geen %s bestand gevonden in wiican package
pt_br: Arquivo %s não encontrado no pacote wiican
ru: Файл, отличный от %s, найден в пакете wiican
sv: Filen %s hittades inte i Wiican-paketet

source: Not %s file found on wiican package
ca: No s'ha trobat el fitxer %s al paquet del wiican
fr: Le fichier %s n'a pas été trouvé dans le paquet wiican
gl: Non se topou o arquivo %s nos paquetes wiican
it: Nessun %s dile trovato nel pacchetto wiican
nl: Geen %s-bestand gevonden in wiican package
pt_br: Arquivo %s não encontrado no pacote wiican
sv: Filen %s hittades inte i Wiican-paketet

source: Wiican Mapping Package load failed!
ca: Ha fallat la càrrega del paquet de mapeig de Wiican.
fr: Le chargement du Paquet de Mapping pour wiican a échoué!
gl: Fallo na carga do mapeado de paquetes de wiican!
it: Errore nel caricamento del Pacchetto delle Mappature di Wiican!
nl: Het laden van het Wiican Mapping Package is mislukt!
pt_br: Falha ao carregar Pacote de Mapeamento do Wiican!
ru: Не удалось загрузить пакет привязки Wiican Mapping Package!
sv: Inläsningen av Wiican-kartläggningspaketet misslyckades!

source: usage: %prog [options] arg
ca: ús: %prog [opcions] arguments
gl: usar: %prog [options] arg
it: utilizzo: %prog [options] arg
nl: gebruik: %prog [opties] arg
pt_br: uso: %prog [opções] arg
ru: Использование: %prog [options] arg
sv: användning: %prog [inställningar] arg

source: loads mapping package from FILENAME
ca: carrega el paquet de mapeig de NOM_DE_FITXER
fr: Charger les paquets de mappings depuis NOMDEFICHIER
gl: Cargar mapeado de paquetes de FILENAME
it: carica il pacchetto delle mappature da FILENAME
nl: Laadt het mapping package uit BESTANDSNAAM
pt_br: carrega pacote de mapeamento do FILENAME
ru: загрузить пакет привязки Wiican Mapping Package из файла FILENAME
sv: läser in kartläggningspaket från FILNAMN

source: No wiican package mapping found: %s
ca: No s'ha trobat el paquet de mapeig de wiican: %s
fr: Le paquet de mapping %s pour wiican n'a pas été trouvé
gl: Non se topou o mapeado de paquetes wiican: %s
it: Non ho trovato nessu pacchetto di mappatura wiican: %s
nl: Geen wiican package mapping gevonden: %s
pt_br: Nenhum mapeamento de pacote Wican encontrados: %s
sv: Inga Wiican-paketskartläggning hittades: %s

source: Wiican Mapping Package
ca: Paquet de mapeig de Wiican
fr: Paquet de Mapping pour Wiican
gl: Mapeador de paquetes Wiican
it: Pacchetto Mappatura Wiican
pt_br: Pacote de Mapeamento do Wiican
ru: Пакет привязки Wiican Mapping Package
sv: Wiican-kartläggningspaket

source: Editing new mapping
ca: S'està editant un nou mapeig
fr: Éditer un nouveau mapping
gl: Editar novo mapeador
it: Modifica nuova mappatura
nl: Nieuwe mapping wordt bewerkt
pt_br: Editando novo mapeamento
ru: Редактировать новые привязки
sv: Ändra ny kartläggning

source: Are you sure you want to completely remove this mapping?
ca: Esteu segur que voleu eliminar aquest mapeig?
fr: Êtes vous sur de vouloir complètement enlever ce mapping?
gl: Está seguro de que quere eliminar por completo este mapeador?
it: Sei sicuro di rimuovere completamente questa mappatura?
nl: Bent u zeker dat u de mapping helemaal wil verwijderen?
pt_br: Tem certeza que deseja remover este mapeamento?
ru: Вы действительно хотите удалить эту конфигурацию привязки?
sv: Är du säker på att du vill ta bort den här kartläggningen?

source: Deleting mappings
ca: S'està esborrant els mapatges
es: Borrando mapeos
fr: Suppression des mappings
gl: Eliminando mapeados
it: Eliminazione impostazioni
nl: Mappings verwijderen
pt_br: Deletando mapeamentos
ru: Удаление привязки
sv: Raderar kartläggningar

source: Import mapping...
ca: S'està important el mapeig...
fr: Importer un mapping...
gl: Importando mapeador...
it: Importa mappatura...
nl: Importeer mapping...
pt_br: Importar mapeamento...
ru: Импортировать файл привязки...
sv: Importera kartläggning...

source: Wiican Mapping Package import failed!
ca: Ha fallat la importació del paquet de mapeig de wiican.
fr: Import du Paquet de Mapping pour wiican échoué!
gl: Fallou a importación do mapeador de paquetes Wiican!
it: Importazione del pacchetto mappatura di Wiican fallita!
nl: Het importeren van het Wiican Mapping Package is mislukt!
pt_br: Falha ao importar Pacote de Mapeamento do Wiican!
ru: Не удалось загрузить файл привязки Wiican Mapping Package
sv: Wiican-kartläggningspaketsimportering misslyckades!

source: Exporting mapping...
ca: S'està exportant el mapeig...
fr: Exporter mapping...
gl: Exportando mapeador...
it: Esportando mappatura...
nl: Mapping wordt geëxporteerd...
pt_br: Exportando mapeamento...
ru: Экспорт привязки...
sv: Exportera kartläggning...

source: Select image icon..
ca: Trieu una icona...
da: Vælg billed ikon..
de: Wähle Bildsymbol
es: Elige icono..
fr: Sélectionnez l'image de l'icône..
gl: Seleccione unha imaxe para o ícone
it: Seleziona l'icona...
nl: Kies een pictogram..
pt_br: Selecione uma imagem para ícone
ru: Выберите изображение для иконки...
sv: Välj ikon...

source: Images
ca: Imatges
da: Billeder
de: Bilder
es: Imágenes
gl: Imaxes
it: Immagini
nl: Afbeeldingen
pt_br: Imagens
sv: Grafik

source: A mapping is running
ca: S'està executant un mapeig
fr: Un mapping est en cours
gl: O mapeador está activo
it: Mappatura in esecuzione
nl: Een mapping is bezig
pt_br: Um mapeamento está em uso
ru: Привязка запущена
sv: En kartläggning körs

source: Execute this mapping
ca: Executa aquest mapeig
fr: Exécuter ce mapping
gl: Executar este mapeador
it: Esegui questa mappatura
nl: Deze mapping uitvoeren
pt_br: Execute este mapeamento
ru: Запустить привязку
sv: Verkställ den här kartläggningen

source: Ensure a bluetooth
ca: Assegura un bluetooth
fr: Assurez vous de votre bluetooth
gl: Asegurar o bluetooth
it: Assicurati di avere il bluetooth
pt_br: Confirma um bluetooth
ru: Включите BlueTooth
sv: Kontrollera bluetooth

source: Mapping not found:
ca: No s'ha trobat el mapeig:
fr: Mapping non trouvé:
gl: Mapeador non atopado
it: Mappatura non trovata:
nl: Mapping niet gevonden:
pt_br: Mapeamento não encontrado:
ru: Привязка не найдена:
sv: Kartläggning hittades inte:

source: Cannot remove a system installed mapping
ca: No es pot eliminar un mapeig instal·lat al sistema
fr: Nous ne pouvons pas retirer un mapping installé par le système
gl: Non se pode elimiar un mapeador do sistema
it: Non è stato possibile rimuovere la mappatura installata nel sistema
nl: Kan systeemgeïnstalleerde mapping niet verwijderen
pt_br: Impossível remover um sistema de mapeamento instalado
ru: Невозможно удалить системную привязку
sv: Kan inte ta bort en systeminstallerad kartläggning

source: Wiican mappings
ca: Mapejos de wiican
fr: Mappings de Wiican
gl: Mapeador Wiican
it: Mappature wiican
pt_br: Mapeamentos Wiican
sv: Wiican-kartläggningar

source: toolbutton1
ca: botó1
fr: outilbouton1
gl: Botón 1
pt_br: ferramenta de botão 1
sv: verktygsknapp1

source: toolbutton2
ca: botó2
fr: outilbouton2
gl: botón 2
pt_br: ferramenta de botão 2
sv: verktygsknapp2

source: toolbutton3
ca: botó3
fr: outilbouton3
gl: botón 3
pt_br: ferramenta de botão 3
sv: verktygsknapp3

source: toolbutton4
ca: botó4
fr: outilbouton4
gl: Botón útil 4
pt_br: ferramenta de botão 4
sv: verktygsknapp4

source: toolbutton5
ca: botó5
fr: outilbouton5
gl: Botón 5
pt_br: ferramenta de botão 5
sv: verktygsknapp5

source: _Name:
ca: _Nom:
fr: _Nom:
gl: _Nome:
it: _Nome:
nl: _Naam:
pt_br: _Nome:
ru: _Название
sv: _Namn:

source: Co_mment:
ca: Co_mentari:
fr: Co_mmentaire:
gl: Co_mentario:
it: Co_mmento:
nl: _Opmerking:
pt_br: Co_mentário:
ru: При_мечание:
sv: Ko_mmentar:

source: A_uthor/s:
ca: A_utor/s:
fr: A_utheur/s
gl: A_utor/es:
it: Autore/i:
pt_br: A_utor/es
ru: А_втор(ы)
sv: _Författare:

source: _Version:
ca: _Versió
gl: _Versión:
it: _Versione:
nl: _Versie
pt_br: _Versão:
ru: _Версия:

source: _Icon:
ca: _Icona:
fr: _Icône:
gl: _Icono
it: _Icona:
nl: P_ictogram:
pt_br: _Ícone:
ru: _Значок:
sv: _Ikon:

source: <b>General</b>
fr: <b>Général</b>
gl: <b>Xeral</b>
it: <b>Generale</b>
nl: <b>Algemeen</b>
pt_br: <b>Geral</b>
ru: <b>Общие</b>
sv: <b>Allmänt</b>

source: This is a system installed mapping. Changes will be saved in a new mapping.
ca: Això és un mapeig instaŀlat al sistema. Es desaran els canvis en un mapeig nou.
fr: Ceci est un mapping installé par le système. Les changements seront sauvé sous un nouveau mapping.
gl: Este é un mapeador do sistema. Os cambios serán gardados nun novo mapeador.
it: Questa è una mappatura installata nel sistema.
nl: Dit is een door het systeem geinstalleerde mapping. Aanpassingen worden opgeslagen in een nieuwe mapping.
pt_br: Este é um mapeamento pré-instalado pelo sistema. Qualquer mudança será salva em um novo mapeamento.
ru: Эта привязка установлена системой. Изменения будут сохранены в новую конфигурацию привязки.
sv: Den här är en systeminstallerad kartläggning. Ändringar kommer att sparas i en ny kartläggning.

source: Execute mapping
ca: Executa el mapeig
fr: Exécuter le mapping
gl: Esecutar mapeador
it: Esegui mappatura
nl: Mapping uitvoeren
pt_br: Executar mapeamento
ru: Выполнить привязку
sv: Verkställ kartläggning

source: Mapping programming help
ca: Ajuda del programa de mapeig
fr: Aide à la programmation de mapping
gl: Axuda programación de mapeadores
it: Aiuto nella programmazione della mappatura
nl: Mapping programmeerhulp
pt_br: Ajuda de configuração de mapeamento
ru: Помощь в программировании привязок wiican
sv: Hjälp för kartläggningsprogrammering

source: <b>Mapping</b>
ca: <b>Mapeig</b>
gl: <b>Mapeador</b>
it: <b>Mappatura</b>
pt_br: <b>Mapeamento</b>
ru: <b>Привязка</b>
sv: <b>Kartläggning</b>

source: Edit mapping
ca: Edita el mapeig
fr: Éditer le mapping
gl: Editar mapeadores
it: Modifica mappatura
nl: Mapping bewerken
pt_br: Editar mapeamento
ru: Изменить отображение
sv: Ändra kartläggning

source: _Edit
ca: _Edita
fr: _Éditer
gl: _Editar
it: Modifica (_E)
nl: B_ewerken
pt_br: _Editar
ru: _Правка
sv: _Redigera

source: Edit mapping properties
ca: Edita les propietats del mapeig
fr: Éditer les propriétés du mapping
gl: Editar as propiedades do mapeador
it: Modifica le proprietà della mappatura
nl: Instellingen van mapping bewerken
pt_br: Editar propriedades de mapeamento
ru: Изменить свойства отображения
sv: Ändra kartläggningsegenskaper

source: Delete mapping
ca: Elimina el mapeig
fr: Effacer le mapping
gl: Borrar mapeador
it: Cancella mappatura
nl: Mapping verwijderen
pt_br: Excluir mapeamento
ru: Удалить отображение
sv: Radera kartläggning

source: _Delete
ca: _Elimina
fr: _Effacer
gl: _Borrar
it: Cancella
nl: Verwij_deren
pt_br: _Excluir
ru: _Удалить
sv: _Radera

source: Removes the mapping from the catalog
ca: Elimina el mapeig del catàleg
fr: Retirer le mapping du catalogue
gl: Elimiar mapeador do catálogo
it: Rimuovi la mappatura dal catalogo
nl: Verwijdert de mapping uit de catalogus
pt_br: Remove o mapeamento a partir do catálogo
sv: Tar bort kartläggningen från kategorin

source: Import mapping
ca: Importa el mapeig
fr: Importer le mapping
gl: Importar mapeador
it: Importa mappatura
nl: Mapping importeren
pt_br: Mapeamento de Importação
ru: Импорт отображения
sv: Importera kartläggning

source: _Import
ca: _Importa
fr: _Importer
gl: _Importar
it: _Importa
nl: _Importeren
pt_br: _Importar
ru: _Импорт
sv: _Importera

source: Import a mapping from a .wii file
ca: Importa un mapeig d'un fitxer .wii
fr: Importer un mapping depuis un fichier .wii
gl: Importar mapeador de arquivo .wii
it: Importa una mappatura da un file .wii
nl: Een mapping importeren uit een .wii-bestand
pt_br: Importar um mapeamento de um arquivo. wii
sv: Importera en kartläggning från en .wii-fil

source: _Export mapping
ca: _Exporta el mapeig
fr: _Exporter le mapping
gl: _Exportar mapeador
it: _Esporta mappatura
nl: Mapping _exporteren
pt_br: _Mapeamento de Exportação
ru: _Экспорт Отображения
sv: _Exportera kartläggning

source: E_xport
ca: E_xporta
fr: E_xporter
gl: E_xportar
it: E_sporta
nl: E_xporteren
pt_br: _Exportar
ru: Э_кспорт
sv: E_xportera

source: Export mapping as a .wii file
ca: Exporta el mapeig com a fitxer .wii
fr: Exporter un mapping en tant que fichier .wii
gl: Exportar mapeador como arquivo .wii
it: Esporta mappatura come file .wii
nl: Een mapping exporteren als een .wii-bestand
pt_br: Exportar mapeamento como um arquivo. wii
ru: Экспорт отображения как *.wii файл
sv: Exportera kartläggning som en .wii-fil

source: New mapping
ca: Mapeig nou
fr: Nouveau mapping
gl: Novo mapeador
it: Nuova mappatura
nl: Nieuwe mapping
pt_br: Novo mapeamento
ru: Новое отображение
sv: Ny kartläggning

source: _New
ca: _Nou
fr: _Nouveau
gl: _Novo
it: _Nuovo
nl: _Nieuw
pt_br: _Novo
ru: _Создать
sv: _Ny

source: Creates a new mapping
ca: Crea un nou mapeig
fr: Crée un nouveau mapping
gl: Crear un novo mapeador
it: Crea una nuova mappatura
nl: Maakt een nieuwe mapping aan
pt_br: Cria um novo mapeamento
sv: Skapar en ny kartläggning

source: Yes wii can Wiimote usage assistant and mapping manager
ca: Wiican Assistent d'ús i gestor de mapejos del WiiMote
es: Yes wii can Asistente de uso de Wiimote y gestor de mapeos
fr: Oui nous pouvons Assistant d'utilisation de la wiimote et gestion des mappings
gl: "Yes wii can" Wiimote usa un asistente e un administrador de mapeador
it: Yes wii can Assistente all'utilizzo di Wiimote e gestore mappature
nl: Yes wii can Wiimote gebruikersondersteuning en mappingbeheer
pt_br: Yes wii can Assistente de configuração e utilização do Wii Remote
sv: Ja Wiican Wiimote användningsassistent och kartläggningshanterare

source: Edit mappings...
ca: Edita els mapejos...
fr: Éditer les mappings...
gl: Editar mapeadores...
it: Modifica mappature...
nl: Mappings bewerken...
pt_br: Editar mapeamentos...
ru: Изменить настройки...
sv: Ändra kartläggningar...

source: Mapping validation failed
ca: Ha fallat la validació del mapeig
fr: Validation du mapping échoué
gl: Fallou a validación do mapeador
it: Validazione delle mappature fallita
nl: Validatie van mapping mislukt
pt_br: Falha na validação de mapeamento
ru: Проверка правильность привязки не удалась
sv: Kartläggningsgodkännande misslyckades

source: It looks the activated mapping contains errors.
ca: Sembla que el mapeig que heu activat conté errors.
fr: Il semblerait que le mapping activé contienne des erreurs.
gl: Está comprobando se o mapeador activo contén erros.
it: Sembra che la mappatura attiva contenga errori.
nl: Waarschijnlijk bevat de geactiveerde mapping fouten.
pt_br: O mapeamento ativado parece conter erros.
ru: Похоже, активированная привязка содержит ошибки.
sv: Det verkar som om den aktiverade kartläggningen innehåller fel.

source: Connected
da: Forbundet
de: Verbunden
es: Conectado

source: Put Wiimote in discoverable mode now (press 1+2)
da: Gør din Wii controller søgbar (tryk 1+2)
es: Ajusta tu Wiimote en modo descubrible ahora (pulsa 1+2)

source: Disconnected
da: Afbrudt
de: Verbindung getrennt
es: Desconectado

source: Wiimote off
da: Wii controlleren er slukket
de: Wiimote aus
es: Wiimote apagado

source: No bluetooth adapters
da: Der er ingen bluetooth adapter
de: Kein Bluetoothadapter
es: No hay adaptador bluetooth disponible

source: Use your wiimote
da: Brug din Wii controller
de: Benutze deine Wiimote
es: Usa tu wiimote

source: Fail!
da: Fejl!
de: Fehlgeschlagen!
es: ¡Fallo!

source: Error discovering Wiimote
da: Ingen Wii controller fundet
de: Fehler beim Auffinden der Wiimote
es: Error descubriendo Wiimote

source: uinput module it's not loaded
de: uinput Modul ist nicht geladen
es: el módulo uinput no está cargado

source: check mapping syntax
de: Kontrolliere die Zuordnungsyntax
es: revisa la sintaxis de tu mapeo

source: Unknown error
da: Ukendt fejl
de: Unbekannter Fehler
es: Error desconocido

source: Can't discover or use wiimote
da: Kan ikke finde eller bruge Wii controlleren
de: Kann Wiimote nicht finden oder benutzen
es: No se puede descubrir o usar wiimote

source: No Name
da: Intet navn
de: Unbenannt
es: Sin Nombre

source: Name
da: Navn
es: Nombre

source: Are you sure you want to completely remove
da: Er du sikker på at du vil slette fuldstændigt
es: ¿Seguro que quiere eliminar definitivamente

source: this mappings?:
es: los siguientes mapeos?:

source: Can't remove mapping
es: No se puede eliminar mapeo

source: Skel config dir doesn't exists
da: Skel config mappen eksisterer ikke.
es: No existe directorio skel de configuración

source: Wrong perms on user config dir
da: Forkerte rettigheder i user config mappen
es: Permisos incorrectos en directorio de configuración del usuario

source: New entry
es: Nueva entrada

source: Name:
es: Nombre:

source: Short name for the mapping
es: Nombre corto para el mapeo

source: Description:
es: Descripción:

source: Comment the use for this mapping
es: Comentario sobre el uso de este mapeo

source: Mapping:
es: Mapeo:

source: wminput help
es: ayuda de wminput

source: Define buttons on wminput config file format
es: Define los botones en formato de fichero de configuración wminput

source: Wiimote mappings
es: Mapeos de wiimote

source: Mappings
es: Mapeos
